In [1]:
import pandas as pd
from glob import glob
import numpy as np

# Load all files for this assignemt

In [2]:
files = glob("ex5/*.csv")
files

['ex5\\billboard.csv',
 'ex5\\customers.csv',
 'ex5\\orders.csv',
 'ex5\\ramen-ratings.csv',
 'ex5\\winemag-data-130k-v2.csv']

# Exercise 1

#### Step 1

In [3]:
df = pd.read_csv(files[-1], index_col=0)
df.head(2)

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos

##### Load only Prosseco review

In [4]:
prosseco_reviews = df[df['variety']=='Prosecco']
prosseco_reviews.head(2)

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
315,Italy,"Honey, almond blossom and citrus zest are foll...",Extra Dry,86,15.0,Veneto,Prosecco di Valdobbiadene,NaN,NaN,NaN,Bellussi NV Extra Dry (Prosecco di Valdobbiad...,Prosecco,Bellussi
319,Italy,Paladin produces a luminous and fresh Prosecco...,Millesimato Brut,86,20.0,Veneto,Veneto,NaN,NaN,NaN,Paladin 2007 Millesimato Brut Prosecco (Veneto),Prosecco,Paladin

#### Step 2

##### Data frame with points more then 89

In [5]:
columns = ['title', 'price', 'points']

In [6]:
good_prosecco = prosseco_reviews[prosseco_reviews['points'] > 89][columns]
good_prosecco.head(4)

                                                   title  price  points
9934   Sorelle Bronca NV Extra Dry Particella 68  (Pr...    NaN      90
40904  Bortolomiol 2008 Cartizze Dry  (Prosecco Super...   30.0      90
40916  Nino Franco 2007 Rive di San Floriano Brut  (P...   30.0      90
47311  Ruggeri & C. 2007 Giustino B. Extra Dry  (Pros...   36.0      91

##### Data frame where point is less then 85

In [7]:
bad_prosecco = prosseco_reviews[prosseco_reviews['points'] < 85][columns]
bad_prosecco.head(4)

                                                   title  price  points
7159                           Tosti NV Prosecco (Italy)   15.0      83
15600  Le Vigne di Alice 2007 Millesimato Doro Brut  ...    NaN      81
36713  Cantina San Martino NV Pittaro Extra Dry  (Pro...   15.0      84
39925  Lisabella NV Gran Resèe Prosecco (Colli Trevig...   12.0      84

#### Step 3
Add title length

In [8]:
good_prosecco = good_prosecco.assign(
    title_length = good_prosecco['title'].apply(lambda x: len(x))
)
good_prosecco.head(4)

,title,price,points,title_length
9934,Sorelle Bronca NV Extra Dry Particella 68 (Pr...,NaN,90,70
40904,Bortolomiol 2008 Cartizze Dry (Prosecco Super...,30.0,90,63
40916,Nino Franco 2007 Rive di San Floriano Brut (P...,30.0,90,71
47311,Ruggeri & C. 2007 Giustino B. Extra Dry (Pros...,36.0,91,68

In [9]:
good_char_mean = good_prosecco['title_length'].mean()
print(f"Average title length for good wine is {good_char_mean}")

Average title length for good wine is 57.588235294117645

In [10]:
bad_prosecco = bad_prosecco.assign(
    title_length = bad_prosecco['title'].apply(lambda x: len(x))
)
bad_prosecco.head(4)

,title,price,points,title_length
7159,Tosti NV Prosecco (Italy),15.0,83,25
15600,Le Vigne di Alice 2007 Millesimato Doro Brut ...,NaN,81,73
36713,Cantina San Martino NV Pittaro Extra Dry (Pro...,15.0,84,63
39925,Lisabella NV Gran Resèe Prosecco (Colli Trevig...,12.0,84,51

In [11]:
bad_char_mean = bad_prosecco['title_length'].mean()
print(f"Average title length for good wine is {bad_char_mean}")

Average title length for good wine is 53.73913043478261

# Exercise 2

#### Step 1

In [12]:
df2 = pd.read_csv(files[3])
df2.head(2)

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN

##### Inspect the data frame missing values and data type

In [13]:
df2.isnull().sum()

Review #       0
Brand          0
Variety        0
Style          2
Country        0
Stars          0
Top Ten     2539
dtype: int64

In [14]:
df2.dtypes

Review #     int64
Brand       object
Variety     object
Style       object
Country     object
Stars       object
Top Ten     object
dtype: object

In [15]:
stars = list(df2['Stars'])
container = []
for s in stars:
    try:
        float(s)
    except ValueError:
        container.append(s)
print(f"uncasting values: {container}")

uncasting values: ['Unrated', 'Unrated', 'Unrated']

In [16]:
df2 = df2[df2['Stars'] != 'Unrated']

In [17]:
df2 = df2.astype({'Stars': 'float64'})
df2.dtypes

Review #      int64
Brand        object
Variety      object
Style        object
Country      object
Stars       float64
Top Ten      object
dtype: object

In [18]:
def q10(y):
    return np.quantile(y, q=0.1)


def q90(y):
    return np.quantile(y, q=0.9)

In [19]:
df2_group_by_country_mean_quantiles = df2.groupby('Country').Stars.agg(['mean', q10, q90])
df2_group_by_country_mean_quantiles

                   mean    q10    q90
Country
Australia      3.138636  2.025  4.000
Bangladesh     3.714286  3.250  4.000
Brazil         4.350000  4.000  4.800
Cambodia       4.200000  3.500  5.000
Canada         2.243902  0.250  3.500
China          3.421893  1.750  4.500
Colombia       3.291667  2.875  3.625
Dubai          3.583333  3.350  3.750
Estonia        3.500000  3.300  3.700
Fiji           3.875000  3.475  4.175
Finland        3.583333  3.500  3.700
Germany        3.638889  3.000  4.350
Ghana          3.500000  3.500  3.500
Holland        3.562500  3.500  3.675
Hong Kong      3.801825  2.750  5.000
Hungary        3.611111  2.950  4.150
India          3.395161  2.000  4.250
Indonesia      4.067460  3.250  5.000
Japan          3.981605  3.000  5.000
Malaysia       4.154194  3.250  5.000
Mexico         3.730000  3.000  4.000
Myanmar        3.946429  2.975  5.000
Nepal          3.553571  3.325  4.175
Netherlands    2.483333  0.500  3.500
Nigeria        1.500000  1.500  1.500
Pakistan       3.000000  2.400  3.600
Philippines    3.329787  1.900  4.500
Poland         3.625000  3.250  4.000
Sarawak        4.333333  4.000  4.800
Singapore      4.126147  3.200  5.000
South Korea    3.790554  2.750  5.000
Sweden         3.250000  3.050  3.450
Taiwan         3.665402  2.000  5.000
Thailand       3.384817  2.000  4.750
UK             2.997101  1.500  4.050
USA            3.457043  2.000  4.750
United States  3.750000  3.750  3.750
Vietnam        3.187963  2.000  4.000

#### Step2

In [20]:
df2_step2 = pd.read_csv(files[3])
df2_step2.head(2)

,Review #,Brand,Variety,Style,Country,Stars,Top Ten
0,2580,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75,NaN
1,2579,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1,NaN

In [21]:
df2_step2_gb = df2_step2.groupby(['Country', 'Style']).Style.count()
df2_step2_gb

Country        Style
Australia      Cup      17
               Pack      5
Bangladesh     Pack      7
Brazil         Cup       2
               Pack      3
                        ..
United States  Pack      1
Vietnam        Bowl     20
               Cup       8
               Pack     78
               Tray      2
Name: Style, Length: 87, dtype: int64

In [22]:
countries = np.sort(df2_step2.Country.unique())
container = [df2_step2_gb.loc[[(f'{country}')]]/df2_step2_gb.loc[[(f'{country}')]].sum() for country in countries]
df_container = pd.concat(container, axis=0)
df_container

Country        Style
Australia      Cup      0.772727
               Pack     0.227273
Bangladesh     Pack     1.000000
Brazil         Cup      0.400000
               Pack     0.600000
                          ...
United States  Pack     1.000000
Vietnam        Bowl     0.185185
               Cup      0.074074
               Pack     0.722222
               Tray     0.018519
Name: Style, Length: 87, dtype: float64

# Exercise 3

In [23]:
import warnings
warnings.filterwarnings("ignore")
df3_customer = pd.read_csv(files[1])
df3_order = pd.read_csv(files[2])
print(f" shape of customer {df3_customer.shape}")
print(f" order of customer {df3_order.shape}")

 shape of customer (34674, 8)
 order of customer (135303, 26)

#### Step 1

In [24]:
df3_customer.head(1)

,akeed_customer_id,gender,dob,status,verified,language,created_at,updated_at
0,TCHWPBT,Male,NaN,1,1,EN,2018-02-07 19:16:23,2018-02-07 19:16:23

In [25]:
df3_order.head(2)

,akeed_order_id,customer_id,item_count,grand_total,payment_mode,promo_code,vendor_discount_amount,promo_code_discount_percentage,is_favorite,is_rated,...,driver_accepted_time,ready_for_pickup_time,picked_up_time,delivered_time,delivery_date,vendor_id,created_at,LOCATION_NUMBER,LOCATION_TYPE,CID X LOC_NUM X VENDOR
0,163238.0,92PEE24,1.0,7.6,2,NaN,0.0,NaN,NaN,No,...,NaN,NaN,NaN,NaN,2019-07-31 05:30:00,105,2019-08-01 05:30:16,0,NaN,92PEE24 X 0 X 105
1,163240.0,QS68UD8,1.0,8.7,1,NaN,0.0,NaN,NaN,No,...,NaN,NaN,NaN,NaN,2019-07-31 05:30:00,294,2019-08-01 05:31:10,0,Work,QS68UD8 X 0 X 294

In [26]:
#df3 = df3_order.join(df3_customer.set_index(['akeed_customer_id'], verify_integrity=True) , on=['customer_id'], how='outer')

In [27]:
df3 = pd.merge(df3_order, df3_customer, how='left', left_on='customer_id', right_on='akeed_customer_id')

In [28]:
df3

,akeed_order_id,customer_id,item_count,grand_total,payment_mode,promo_code,vendor_discount_amount,promo_code_discount_percentage,is_favorite,is_rated,...,LOCATION_TYPE,CID X LOC_NUM X VENDOR,akeed_customer_id,gender,dob,status,verified,language,created_at_y,updated_at
0,163238.0,92PEE24,1.0,7.6,2,NaN,0.0,NaN,NaN,No,...,NaN,92PEE24 X 0 X 105,92PEE24,Male,NaN,1.0,1.0,EN,2018-11-06 16:46:08,2018-11-06 16:46:07
1,163240.0,QS68UD8,1.0,8.7,1,NaN,0.0,NaN,NaN,No,...,Work,QS68UD8 X 0 X 294,QS68UD8,NaN,NaN,1.0,1.0,EN,2019-08-09 00:57:11,2019-10-01 18:53:22
2,163241.0,MB7VY5F,2.0,14.4,1,NaN,0.0,NaN,NaN,No,...,NaN,MB7VY5F X 0 X 83,MB7VY5F,NaN,NaN,1.0,1.0,EN,2019-07-03 14:25:10,2019-10-01 18:49:08
3,163244.0,KDJ951Y,1.0,7.1,1,NaN,0.0,NaN,NaN,No,...,Home,KDJ951Y X 0 X 90,KDJ951Y,Male,NaN,1.0,1.0,EN,2019-01-04 21:33:08,2019-01-04 21:33:08
4,163245.0,BAL0RVT,4.0,27.2,1,NaN,0.0,NaN,NaN,No,...,Work,BAL0RVT X 0 X 83,BAL0RVT,Male,NaN,1.0,1.0,EN,2018-10-16 20:44:27,2018-10-16 20:44:26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
135497,415507.0,L6LFY6H,1.0,13.3,2,NaN,0.0,0.0,No,No,...,NaN,L6LFY6H X 0 X 67,L6LFY6H,NaN,NaN,1.0,1.0,NaN,2020-02-09 19:33:04,2020-02-09 19:33:27
135498,415508.0,2GMMVGI,3.0,9.5,1,NaN,0.0,0.0,No,Yes,...,Work,2GMMVGI X 0 X 79,2GMMVGI,Male,NaN,1.0,1.0,NaN,2019-11-03 12:49:01,2019-11-16 17:40:05
135499,415510.0,LYTAAV0,4.0,18.2,2,NaN,0.0,0.0,No,No,...,Other,LYTAAV0 X 2 X 28,LYTAAV0,Male,NaN,1.0,1.0,EN,2019-04-15 14:51:34,2019-04-15 14:51:34
135500,415512.0,NEV9A5D,3.0,7.7,1,NUE5BZAA7,0.0,0.0,No,No,...,NaN,NEV9A5D X 0 X 841,NEV9A5D,NaN,NaN,1.0,1.0,NaN,2020-02-27 20:15:39,2020-02-27 20:15:53
135501,415515.0,77KCRC1,1.0,6.8,2,NaN,0.0,0.0,No,No,...,NaN,77KCRC1 X 4 X 79,77KCRC1,Male,NaN,1.0,1.0,EN,2019-09-08 16:51:11,2019-11-16 16:14:06

In [29]:
df3_gender_count = df3[['item_count', 'gender']]
df3_gender_count

        item_count gender
0              1.0   Male
1              1.0    NaN
2              2.0    NaN
3              1.0   Male
4              4.0   Male
...            ...    ...
135497         1.0    NaN
135498         3.0   Male
135499         4.0   Male
135500         3.0    NaN
135501         1.0   Male

[135502 rows x 2 columns]

#### Step 2

In [30]:
values = {'  ': np.nan, ', ': np.nan, 'male': 'Male'}
df3_gc_no_nan = df3_gender_count.replace({'gender': values} )
df3_gc_no_nan = df3_gc_no_nan.dropna()
df3_gc_no_nan

        item_count gender
0              1.0   Male
3              1.0   Male
4              4.0   Male
5              3.0   Male
6              2.0   Male
...            ...    ...
135493         1.0   Male
135495         1.0   Male
135498         3.0   Male
135499         4.0   Male
135501         1.0   Male

[98781 rows x 2 columns]

In [31]:
df3_gc_no_nan.gender = df3_gc_no_nan.gender.apply(lambda s: s.strip())
df3_gc_no_nan

        item_count gender
0              1.0   Male
3              1.0   Male
4              4.0   Male
5              3.0   Male
6              2.0   Male
...            ...    ...
135493         1.0   Male
135495         1.0   Male
135498         3.0   Male
135499         4.0   Male
135501         1.0   Male

[98781 rows x 2 columns]

In [32]:
gender = list(df3_gc_no_nan.gender)
count = list(df3_gc_no_nan.item_count)
print(   list(set(gender))  )

['Female', 'Male']

In [33]:
df3_gb = df3_gc_no_nan.groupby('gender').mean()
df3_gb

        item_count
gender
Female    2.381009
Male      2.414087

# Exercise 4

In [34]:
df4 = pd.read_csv(files[0])
df4.head(2)

,year,artist.inverted,track,time,genre,date.entered,date.peaked,x1st.week,x2nd.week,x3rd.week,...,x67th.week,x68th.week,x69th.week,x70th.week,x71st.week,x72nd.week,x73rd.week,x74th.week,x75th.week,x76th.week
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,78,63.0,49.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,15,8.0,6.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#### Step 1

In [35]:
vars_cols = list(df4.loc[:, 'year': 'date.peaked'])
values_cols = list(df4.loc[:, 'x1st.week': ])
df41 = pd.melt(df4, id_vars=vars_cols, value_vars=values_cols, var_name='week', value_name='rank')
df41

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,x1st.week,78.0
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,x1st.week,15.0
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,x1st.week,71.0
3,2000,Madonna,Music,3:45,Rock,2000-08-12,2000-09-16,x1st.week,41.0
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),3:38,Rock,2000-08-05,2000-10-14,x1st.week,57.0
...,...,...,...,...,...,...,...,...,...
24087,2000,Ghostface Killah,Cherchez LaGhost,3:04,R&B,2000-08-05,2000-08-05,x76th.week,NaN
24088,2000,"Smith, Will",Freakin' It,3:58,Rap,2000-02-12,2000-02-12,x76th.week,NaN
24089,2000,Zombie Nation,Kernkraft 400,3:30,Rock,2000-09-02,2000-09-02,x76th.week,NaN
24090,2000,"Eastsidaz, The",Got Beef,3:58,Rap,2000-07-01,2000-07-01,x76th.week,NaN
24091,2000,Fragma,Toca's Miracle,3:22,R&B,2000-10-28,2000-10-28,x76th.week,NaN

#### Step 2

In [36]:
df41.dtypes

year                 int64
artist.inverted     object
track               object
time                object
genre               object
date.entered        object
date.peaked         object
week                object
rank               float64
dtype: object

In [37]:
df41.week = df41.week.apply(lambda s: int(s.split('x')[1][0]))
df41.dtypes

year                 int64
artist.inverted     object
track               object
time                object
genre               object
date.entered        object
date.peaked         object
week                 int64
rank               float64
dtype: object

In [39]:
df41

,year,artist.inverted,track,time,genre,date.entered,date.peaked,week,rank
0,2000,Destiny's Child,Independent Women Part I,3:38,Rock,2000-09-23,2000-11-18,1,78.0
1,2000,Santana,"Maria, Maria",4:18,Rock,2000-02-12,2000-04-08,1,15.0
2,2000,Savage Garden,I Knew I Loved You,4:07,Rock,1999-10-23,2000-01-29,1,71.0
3,2000,Madonna,Music,3:45,Rock,2000-08-12,2000-09-16,1,41.0
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),3:38,Rock,2000-08-05,2000-10-14,1,57.0
...,...,...,...,...,...,...,...,...,...
24087,2000,Ghostface Killah,Cherchez LaGhost,3:04,R&B,2000-08-05,2000-08-05,7,NaN
24088,2000,"Smith, Will",Freakin' It,3:58,Rap,2000-02-12,2000-02-12,7,NaN
24089,2000,Zombie Nation,Kernkraft 400,3:30,Rock,2000-09-02,2000-09-02,7,NaN
24090,2000,"Eastsidaz, The",Got Beef,3:58,Rap,2000-07-01,2000-07-01,7,NaN
24091,2000,Fragma,Toca's Miracle,3:22,R&B,2000-10-28,2000-10-28,7,NaN